%----------------------------系统仿真参数 
fc=2;   	%载波频率（Hz） 
fb=1;		%码元频率
Ts=1/fb;   	% 码元宽度 
snr=5;  	%信噪比dB 
fs=16;		%系统采样率 
ts=1/fs; % 系统采样间隔 
N=1000;  	% 码元数 

t=0:ts:N*Ts-ts; %采样时间序列
t=t.'; 

NFFT=[];
window=[];
noverlap=[];
N_BPF = 48;     %FIR带通滤波器阶数
N_LPF = 48;     %FIR低通滤波器阶数
%----------------------------产生二进制信源
B=randi([0,1],1,N); 
sym=[0; 1];  
A=sym(B+1); 
S=rectpulse(A, N_sample); 
draw(331,t,S,fs,'未调制信号');

%----------------------------调制
X=S.*cos(2*pi*fc*t);
draw(332,t,X,fs,'调制信号');

%----------------------------信道噪声
X_n = awgn(X,snr);
draw(333,t,X_n,fs,'信道噪声干扰后');

%----------------------------带通滤波器
W = [(fc-fb)/(fs/2) (fc+fb)/(fs/2)];
b1 = fir1(N_BPF,W);
X_bpf = filter(b1,1,X_n);
draw(334,t,X_bpf,fs,'带通滤波器后');


%----------------------------相干解调之乘载波
r=2*X_bpf.*cos(2*pi*fc*t);
draw(335,t,r,fs,'相干解调乘载波后');

%----------------------------相干解调之低通滤波器
b2 = fir1(N_LPF,fb/(fs/2));
X_lpf = filter(b2,1,r);
draw(336,t,X_lpf,fs,'相干解调低通滤波后');

%----------------------------时延补偿，抽样判决
%补偿前面FIR带通和低通滤波器引入的时延,分别为滤波器阶数的一半
delay = N_BPF + N_LPF;
X_r = X_lpf(48:end);
draw(337,t,X_r,fs,'滤波器时延补偿后');
N=N-3;
B=B(1:end-3);
index = fs/2:fs:N*fs-fs/2;
Sr=X_r(index)'; 

Br=Sr>0.5; 

%----------------------------计算误码率
errbit=sum(Br~=B); 
ber=errbit/N; % 误码率