snrs = [];

for i = -40:0.5:20
    snr = i;
    X_n = awgn(X,snr);
    %----------------------------带通滤波器
    X_bpf = filter(b1,1,X_n);

    %----------------------------相干解调之乘载波
    r=2*X_bpf.*cos(2*pi*fc*t);
    %----------------------------相干解调之低通滤波器
    X_lpf = filter(b2,1,r);
    %----------------------------时延补偿，抽样判决
    %补偿前面FIR带通和低通滤波器引入的时延,分别为滤波器阶数的一半
    X_r = X_lpf(48:end);
    index = fs/2:fs:N*fs-fs/2;
    Sr=X_r(index)'; 

    Br=Sr>0.5; 
    %----------------------------计算误码率
    errbit=sum(Br~=B); 
    ber=errbit/N; % 误码率
    snrs = [snrs ber];
end